---
kind: property
id: P:Autodesk.Revit.DB.DefaultDivideSettings.PathDistance
source: html/651d91ee-9edb-5106-fb10-0c06331e61cb.htm
---
# Autodesk.Revit.DB.DefaultDivideSettings.PathDistance Property

A default Divided Path distance for a fixed, minimum, or maximum distance layout.

## Syntax (C#)
```csharp
public double PathDistance { get; set; }
```